class APIConstants {
  static const int apiPort = 25891;
  static const String apiHost = "89.108.70.221";
}

class RegionsNumsConstants {
  static const Map<String, String> regs = {
    "Республика Адыгея": "01",
    "Республика Алтай": "04",
    "Республика Башкортостан": "02",
    "Республика Бурятия": "03",
    "Республика Дагестан": "05",
    "Республика Ингушетия": "06",
    "Кабардино-Балкарская республика": "07",
    "Республика Калмыкия": "08",
    "Карачаево-Черкесская республика": "09",
    "Республика Карелия": "10",
    "Республика Коми": "11",
    "Республика Крым": "91",
    "Республика Марий Эл": "12",
    "Республика Мордовия": "13",
    "Республика Саха (Якутия)": "14",
    "Республика Северная Осетия — Алания": "15",
    "Республика Татарстан": "16",
    "Республика Тыва": "17",
    "Удмуртская республика": "18",
    "Республика Хакасия": "19",
    "Чеченская республика": "20",
    "Чувашская республика": "21",
    "Алтайский край": "22",
    "Забайкальский край": "75",
    "Камчатский край": "41",
    "Краснодарский край": "23",
    "Красноярский край": "24",
    "Пермский край": "59",
    "Приморский край": "25",
    "Ставропольский край": "26",
    "Хабаровский край": "27",
    "Амурская область": "28",
    "Архангельская область": "29",
    "Астраханская область": "30",
    "Белгородская область": "31",
    "Брянская область": "32",
    "Владимирская область": "33",
    "Волгоградская область": "34",
    "Вологодская область": "35",
    "Воронежская область": "36",
    "Ивановская область": "37",
    "Иркутская область": "38",
    "Калининградская область": "39",
    "Калужская область": "40",
    "Кемеровская область": "42",
    "Кировская область": "43",
    "Костромская область": "44",
    "Курганская область": "45",
    "Курская область": "46",
    "Ленинградская область": "47",
    "Липецкая область": "48",
    "Магаданская область": "49",
    "Московская область": "50",
    "Мурманская область": "51",
    "Нижегородская область": "52",
    "Новгородская область": "53",
    "Новосибирская область": "54",
    "Омская область": "55",
    "Оренбургская область": "56",
    "Орловская область": "57",
    "Пензенская область": "58",
    "Псковская область": "60",
    "Ростовская область": "61",
    "Рязанская область": "62",
    "Самарская область": "63",
    "Саратовская область": "64",
    "Сахалинская область": "65",
    "Свердловская область": "66",
    "Смоленская область": "67",
    "Тамбовская область": "68",
    "Тверская область": "69",
    "Томская область": "70",
    "Тульская область": "71",
    "Тюменская область": "72",
    "Ульяновская область": "73",
    "Челябинская область": "74",
    "Ярославская область": "76",
    "Москва": "77",
    "Санкт-Петербург": "78",
    "Севастополь": "92",
    "Еврейская автономная область": "79",
    "Ненецкий автономный округ": "83",
    "Ханты-Мансийский автономный округ - Югра": "86",
    "Чукотский автономный округ": "87",
    "Ямало-Ненецкий автономный округ": "89",
  };
}

class TextConstants {
  static const List<String> months = [
    'Январь',
    'Февраль',
    'Март',
    'Апрель',
    'Май',
    'Июнь',
    'Июль',
    'Август',
    'Сентябрь',
    'Октябрь',
    'Ноябрь',
    'Декабрь'
  ];
}

class ErrorsConstants {
  static const String unavailable =
      "Сервер временно недоступен, попробуйте позже.";
}

class TimeConstants {
  static const Duration updatePeriod = Duration(minutes: 1);
}

class NumericConstants {
  static const int supplyThreshold = 10;
}
